package com.example.wethtorang.ckcc.ListsPoem;

import android.os.Bundle;

import android.support.v7.app.AppCompatActivity;
import android.support.v7.widget.LinearLayoutManager;
import android.support.v7.widget.RecyclerView;

import com.example.wethtorang.ckcc.R;

import java.util.ArrayList;

/**
 * Created by WETHTORANG on 7/19/2016.
 */
public class SevenPeom extends AppCompatActivity {
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main2);
        getSupportActionBar().setDefaultDisplayHomeAsUpEnabled(true);
        setTitle("បទពាក្យប្រាំពី");
        RecyclerView recyclerView = (RecyclerView) findViewById(R.id.recycler_view_list);

        LinearLayoutManager linearLayoutManager = new LinearLayoutManager(getApplicationContext());
        recyclerView.setLayoutManager(linearLayoutManager);
        ArrayList<Peom> Peom = new ArrayList<>();
        Peom peom = new Peom("ព្រះរាជាណាចក្រកម្ពុជា","វី\u200Bទៅ\u200Bគេ\u200Bហៅ\u200Bថា\u200Bគ្រឿងញៀន ឮ\t\t" +
                "ដែលមានលក់ដូរដោយលួច\u200Bលាក់\n" +
                "មនុស្ស\u200Bជា\u200Bច្រើនជាប់\u200Bជំពាក់\t\t" +
                "លប\u200Bទិញ\u200Bលួចលាក់\u200Bយកប្រើប្រាស់។\n" +
                "គ្រឿង\u200Bញៀន\u200Bគឺជា\u200Bគីមី\u200Bផ្សំ\t\t" +
                "ដែល\u200Bគេលាយ\u200Bឡំធាតុផ្តេស\u200Bផ្តាស់\n" +
                "មាន\u200Bសមត្ថិ\u200Bភាព\u200Bអាច\u200Bប្តូរ\u200Bផ្លាស់\t\t" +
                "ជា\u200Bច្រើន\u200Bផ្នែកណាស់\u200Bនៃរាងកាយ។\n" +
                "វា\u200Bមាន\u200Bឥទ្ធិពល\u200Bដល់ប្រាសាទ\t\t" +
                "ឲ្យ\u200Bយើង\u200Bលែង\u200Bឆ្លាតលែងគិតឆ្ងាយ\n" +
                "យូរ\u200Bទៅ\u200Bរូបយើងនឹងប្រែក្លាយ\t\t" +
                "ធ្លាក់កាយក្លាយរោគ\u200Bសញ្ញាញៀន។\n" +
                "អង្គការ\u200Bសហប្រជាជាតិ\t\t" +
                "បាន\u200Bកំណត់ទៀតថា\u200Bវាមាន\n" +
                "ដំណើរ\u200Bស្រវឹ\u200Bងកើតពុលឃ្លាន\t\t" +
                "ពោលគឺឲ្យ\u200Bញៀន\u200Bពិបាកផ្តាច់។\n" +
                "គ្រឿង\u200Bញៀន\u200Bដែល\u200Bគេលួចចរា\t\t" +
                "គឺមាន\u200Bយ៉ាម៉ា\u200Bសូនគ្រាប់ស្រេច\n" +
                "ហេរ៉ូអ៊ីនញៀនមិនងាយ\u200Bផ្តាច់\t\t" +
                "ក៏\u200Bគេសូន\u200Bស្រេចលក់មួយៗ។\n" +
                "ចំណែក\u200Bថ្នាំឈ្មោះ\u200Bអ៊ីចស្តាស៊ី\t\t" +
                "ឲ្យ\u200Bក្បាលគ្រវីដូចបង្កួយ\n" +
                "ច្រើនលក់ក្នុងបាជាជំនួយ\t\t" +
                "ឲ្យ\u200Bអ្នកណាមួយអាចរាំបាន។\n" +
                "រីឯកាវ\u200Bវិញ\u200Bសំបូរដែរ\t\t" +
                "ក្មេងអាវ៉ាសែទាំងប៉ុន្មាន\n" +
                "តែង\u200Bយក\u200Bជាមួយជាប់នឹងប្រាណ\t\t" +
                "ពេលញៀនរុករានគេយកហិត។\n" +
                "មួយទៀតកញ្ឆាអាហារផ្សែង\t\t" +
                "គេតែងជក់វាឥតអាណិត\n" +
                "ក៏ព្រោះតែពុំបានដឹងពឹត\t\t" +
                "ថាវាទាញយឹត\u200Bទៅ\u200Bគ្រោះ\u200Bភ័យ។\n" +
                "ចំណែក\u200Bបារី\u200Bនិង\u200Bសុរា\t\t" +
                "ដែល\u200Bគេ\u200Bគិត\u200Bថា\u200Bពុំ\u200Bសូវ\u200Bអី\n" +
                "តែ\u200Bក៏\u200Bនាំ\u200Bគ្រោះ\u200Bកើត\u200Bទុក\u200Bភ័យ\t\t" +
                "ឲ្យ\u200Bយើង\u200Bប្រុស\u200Bស្រី\u200Bខូច\u200Bសុខភាព។\n" +
                "បើ\u200Bដឹង\u200Bគ្រោះ\u200Bថា្នក់\u200Bម្តេច\u200Bក៏មនុស្ស\t\t" +
                "ចចេស\u200Bរឹងរួស\u200Bធ្វើ\u200Bថោកទាប\n" +
                "ប្រើថ្នាំ\u200Bទាល់\u200Bតែចូលជ្រួតជ្រាប\t\t" +
                "ពីមុនសុភាពឥឡូវកោង។\n" +
                "មូលហេតុក៏ព្រោះតែចង់សាក\t\t" +
                "បារីបឺតខាកខ្អកគ្រប់យ៉ាង\n" +
                "តែស៊ូទ្រាំ\u200Bជក់\u200Bទាំង\u200Bក្មេងក្មាង\t\t" +
                "ពេលញៀនកើតកាងកើតកាប់ចាក់។\n"  );
        Peom peom1 = new Peom("ច្បាប់ប្រុស","មើលវាលធំធេងរេងរលឺក                    មើលទឹករលករលាមសាយ\n" +
                "\n" +
                "មើលដីដីដុះវែងអន្លាយ                       មើលមេឃខ្ពស់ឆ្ងាយដូចឆ្ងាយស្រី។\n" +
                "\n" +
                "[…]\n" +
                "\n" +
                "ប្អូនអើយប្អូនស្ងួននួនថ្លើមចិត្ត                អាណិតបងចុះណាសារិកា\n" +
                "\n" +
                "សូមអូនហារមាត់មកវាចារ                    នឹងបងតិចរ៉ាកុំបីស្ងាត់។\n" +
                "\n" +
                "បំណាច់ចំណង់បងមកដល់                   នាឋានមណ្ឌលប្អូនស្រីរ័ត្ន\n" +
                "\n" +
                "ចង់លឺពាក្យប្អូនបានមួយម៉ាត់                 សូមអូនសារសព្ទសងវាចារ។");
        Peom peom2 = new Peom("ច្បាប់ស្រី","ថ្ងៃរះជ្រៀលជ្រេរេគោងភ្នំ                                                   ផុតព្រៃតូចធំដុះអមផ្លូវ\n" +
                "\n" +
                "រថយន្តយើងបោលសំដៅទៅ                                           កាត់ព្រៃភ្នំជ្រៅទៅស្ទឹងត្រែង។\n" +
                "\n" +
                "មកដល់ខេត្តនេះវ៊ីសនឹងយប់                                            យើងឥតឈរឈប់សួរគេឯង\n" +
                "\n" +
                "សួររកផ្ទះទុកស្នាក់សម្បែង                                                សម្រាកស្ទឹងត្រែងមួយរាត្រី។\n" +
                "\n" +
                "លុះព្រឹកស្វាងជ្រះស្រលះមេឃ                                        ខ្ញុំក្រោកពីដេកឥតខ្វល់អ្វី\n" +
                "\n" +
                "រៀបចំខ្លួនរួចចុះទៅដី                                                          ដើរមើលប្រុសស្រីដីជាយដែន។\n" +
                "\n" +
                "ខ្ញុំតម្រង់ទៅមាត់ទន្លេ                                                         ឃើញគេដឹកត្រីឡើងពេញណែន\n" +
                "\n" +
                "តាមទូកតូចធំប្រឹងបត់បែន                                                ដឹកត្រីរាប់សែនយកឡើងជ្រាំង។\n");
        Peom peom3 = new Peom("ច្បាប់ក្រមងុយ","សំបុរនាងសដូចកូនចិន                                                     រាងដូចត្បាល់កិនឫកស្លោស្លន់\n" +
                "\n" +
                "ប្រញាប់ទៅណាទើបរហន់                                                វ៊ីសនាំអាសន្នដល់រូបខ្ញុំ។\n" +
                "\n" +
                "ទោះកង់នាងបុកក៏មិនថ្វី                                                     ព្រោះបានឃើញស្រីពៅមាសមុំ\n" +
                "\n" +
                "ឬមួយនាងជាគូព្រេងខ្ញុំ                                                        ទើបអ្វីនាំមុំមកជួបបង។\n" +
                "\n" +
                "ខ្ញុំមិនគិតទេរាងមិនល្អ                                                          ទោះមានសាច់សមាឌធំផង\n" +
                "\n" +
                "ឲតែរូបនាងបានមកបង                                                       រាមនឹងថ្នាក់ថ្នមដូចបាវសាក់។\n" +
                "\n" +
                "ជួបនាងយូរហើយឥតឃើញស្តី                                         ឬស្រីនូវមានការថ្នាំងថ្នាក់\n" +
                "\n" +
                "ព្រោះអីកង់នាងក៏បែកបាក់                                                 ខ្លួនក៏ប្រលាក់ដោយភក់ដី។\n" +
                "\n" +
                "លុះខ្ញុំសួរទៅនាងតបថា                                                      អត់ទោសបងណាសូមអភ័យ\n" +
                "\n" +
                "ខ្ញុំប្រញាប់ឆាប់ទៅទិញត្រី                                                   ទើបធ្វេសស្មារតីមកបុកបង។\n" +
                "\n" +
                "វាចារពិរោះបែបរដឺន                                                             ផ្គើនចិត្តឲខ្ញុំរឹតចាំចង\n" +
                "\n"
                );
        Peom peom4 = new Peom("គំរូ","\"\\n\" +\n" +
                "                \"ខ្ញុំក៏ដើរហួសទៅតាមផ្លូវ                                                       រួចត្រូវកង់បុកលាន់លឺផាំង\\n\" +\n" +
                "                \"\\n\" +\n" +
                "                \"ស្រីម្នាក់បុកខ្ញុំមុខឡើងស្លាំង                                              ភ័យខ្លាំងនាងអោនឥតងើយមុខ។\\n\" +\n" +
                "                \"\\n\" +\n" +
                "                \"ដំបូងខ្ញុំខឹងវ៊ីសជេស្តី                                                             តែលុះឃើញស្រីធាត់ទ្រលុក\\n\" +\n" +
                "                \"\\n\" +\n" +
                "                \"ទោះឈឺប៉ុណ្ណាខ្ញុំលាក់ទុក                                                  ប្រាប់នាងងើយមុខចរចារគ្នា។\\n\" +\n" +
                "                \"\\n\" +\n" +
                "                \"នាងងើយមុខចំចំជាស្អាត ថ្                                   ពាល់ឡើងក្រប៉ាតមុខពេញហ៊ារ\\n\" +\n" +
                "                \"\\n\" +\n" +
                "                \"ច្រមុះកោងស្រួចសាច់ថ្ពាល់យា                                      សក់ដូចរោមទាមានឈ្មោលជាន់។");
        Peom peom5 = new Peom("ប្រាសាទព្រះវិហារ","ដំបូងខ្ញុំខឹងវ៊ីសជេស្តី                                                             តែលុះឃើញស្រីធាត់ទ្រលុក\n" +
                "\n" +
                "ទោះឈឺប៉ុណ្ណាខ្ញុំលាក់ទុក                                                  ប្រាប់នាងងើយមុខចរចារគ្នា។\n" +
                "\n" +
                "នាងងើយមុខចំចំជាស្អាត ថ្                                   ពាល់ឡើងក្រប៉ាតមុខពេញហ៊ារ\n" +
                "\n" +
                "ច្រមុះកោងស្រួចសាច់ថ្ពាល់យា                                      សក់ដូចរោមទាមានឈ្មោលជាន់។\n" +
                "\n" +
                "សំបុរនាងសដូចកូនចិន                                                     រាងដូចត្បាល់កិនឫកស្លោស្លន់\n" +
                "\n" +
                "ប្រញាប់ទៅណាទើបរហន់                                                វ៊ីសនាំអាសន្នដល់រូបខ្ញុំ។\n" +
                "\n" +
                "ទោះកង់នាងបុកក៏មិនថ្វី                                                     ព្រោះបានឃើញស្រីពៅមាសមុំ\n" +
                "\n" +
                "ឬមួយនាងជាគូព្រេងខ្ញុំ                                                        ទើបអ្វីនាំមុំមកជួបបង។");
        Peom peom6 = new Peom("ក កា​ កិ កី","ដំបូងខ្ញុំខឹងវ៊ីសជេស្តី                                                             តែលុះឃើញស្រីធាត់ទ្រលុក\n" +
                "\n" +
                "ទោះឈឺប៉ុណ្ណាខ្ញុំលាក់ទុក                                                  ប្រាប់នាងងើយមុខចរចារគ្នា។\n" +
                "\n" +
                "នាងងើយមុខចំចំជាស្អាត ថ្                                   ពាល់ឡើងក្រប៉ាតមុខពេញហ៊ារ\n" +
                "\n" +
                "ច្រមុះកោងស្រួចសាច់ថ្ពាល់យា                                      សក់ដូចរោមទាមានឈ្មោលជាន់។\n" +
                "\n" +
                "សំបុរនាងសដូចកូនចិន                                                     រាងដូចត្បាល់កិនឫកស្លោស្លន់\n" +
                "\n" +
                "ប្រញាប់ទៅណាទើបរហន់                                                វ៊ីសនាំអាសន្នដល់រូបខ្ញុំ។\n" +
                "\n" +
                "ទោះកង់នាងបុកក៏មិនថ្វី                                                     ព្រោះបានឃើញស្រីពៅមាសមុំ\n" +
                "\n" +
                "ឬមួយនាងជាគូព្រេងខ្ញុំ                                                        ទើបអ្វីនាំមុំមកជួបបង។");
        Peom peom7 = new Peom("ក​ ខ​ គ ឃ ង","ដំបូងខ្ញុំខឹងវ៊ីសជេស្តី                                                             តែលុះឃើញស្រីធាត់ទ្រលុក\n" +
                "\n" +
                "ទោះឈឺប៉ុណ្ណាខ្ញុំលាក់ទុក                                                  ប្រាប់នាងងើយមុខចរចារគ្នា។\n" +
                "\n" +
                "នាងងើយមុខចំចំជាស្អាត ថ្                                   ពាល់ឡើងក្រប៉ាតមុខពេញហ៊ារ\n" +
                "\n" +
                "ច្រមុះកោងស្រួចសាច់ថ្ពាល់យា                                      សក់ដូចរោមទាមានឈ្មោលជាន់។\n" +
                "\n" +
                "សំបុរនាងសដូចកូនចិន                                                     រាងដូចត្បាល់កិនឫកស្លោស្លន់\n" +
                "\n" +
                "ប្រញាប់ទៅណាទើបរហន់                                                វ៊ីសនាំអាសន្នដល់រូបខ្ញុំ។\n" +
                "\n" +
                "ទោះកង់នាងបុកក៏មិនថ្វី                                                     ព្រោះបានឃើញស្រីពៅមាសមុំ\n" +
                "\n" +
                "ឬមួយនាងជាគូព្រេងខ្ញុំ                                                        ទើបអ្វីនាំមុំមកជួបបង។");
        Peom peom8 = new Peom("វិហារស្នេហា","ដំបូងខ្ញុំខឹងវ៊ីសជេស្តី                                                             តែលុះឃើញស្រីធាត់ទ្រលុក\n" +
                "\n" +
                "ទោះឈឺប៉ុណ្ណាខ្ញុំលាក់ទុក                                                  ប្រាប់នាងងើយមុខចរចារគ្នា។\n" +
                "\n" +
                "នាងងើយមុខចំចំជាស្អាត ថ្                                   ពាល់ឡើងក្រប៉ាតមុខពេញហ៊ារ\n" +
                "\n" +
                "ច្រមុះកោងស្រួចសាច់ថ្ពាល់យា                                      សក់ដូចរោមទាមានឈ្មោលជាន់។\n" +
                "\n" +
                "សំបុរនាងសដូចកូនចិន                                                     រាងដូចត្បាល់កិនឫកស្លោស្លន់\n" +
                "\n" +
                "ប្រញាប់ទៅណាទើបរហន់                                                វ៊ីសនាំអាសន្នដល់រូបខ្ញុំ។\n" +
                "\n" +
                "ទោះកង់នាងបុកក៏មិនថ្វី                                                     ព្រោះបានឃើញស្រីពៅមាសមុំ\n" +
                "\n" +
                "ឬមួយនាងជាគូព្រេងខ្ញុំ                                                        ទើបអ្វីនាំមុំមកជួបបង។");
        Peom peom9 = new Peom("បេះដូងសំរាប់ចិត្ត","ដំបូងខ្ញុំខឹងវ៊ីសជេស្តី                                                             តែលុះឃើញស្រីធាត់ទ្រលុក\n" +
                "\n" +
                "ទោះឈឺប៉ុណ្ណាខ្ញុំលាក់ទុក                                                  ប្រាប់នាងងើយមុខចរចារគ្នា។\n" +
                "\n" +
                "នាងងើយមុខចំចំជាស្អាត ថ្                                   ពាល់ឡើងក្រប៉ាតមុខពេញហ៊ារ\n" +
                "\n" +
                "ច្រមុះកោងស្រួចសាច់ថ្ពាល់យា                                      សក់ដូចរោមទាមានឈ្មោលជាន់។\n" +
                "\n" +
                "សំបុរនាងសដូចកូនចិន                                                     រាងដូចត្បាល់កិនឫកស្លោស្លន់\n" +
                "\n" +
                "ប្រញាប់ទៅណាទើបរហន់                                                វ៊ីសនាំអាសន្នដល់រូបខ្ញុំ។\n" +
                "\n" +
                "ទោះកង់នាងបុកក៏មិនថ្វី                                                     ព្រោះបានឃើញស្រីពៅមាសមុំ\n" +
                "\n" +
                "ឬមួយនាងជាគូព្រេងខ្ញុំ                                                        ទើបអ្វីនាំមុំមកជួបបង។");
        Peom peom10 = new Peom("ភូមិខ្មែរ","ដំបូងខ្ញុំខឹងវ៊ីសជេស្តី                                                             តែលុះឃើញស្រីធាត់ទ្រលុក\n" +
                "\n" +
                "ទោះឈឺប៉ុណ្ណាខ្ញុំលាក់ទុក                                                  ប្រាប់នាងងើយមុខចរចារគ្នា។\n" +
                "\n" +
                "នាងងើយមុខចំចំជាស្អាត ថ្                                   ពាល់ឡើងក្រប៉ាតមុខពេញហ៊ារ\n" +
                "\n" +
                "ច្រមុះកោងស្រួចសាច់ថ្ពាល់យា                                      សក់ដូចរោមទាមានឈ្មោលជាន់។\n" +
                "\n" +
                "សំបុរនាងសដូចកូនចិន                                                     រាងដូចត្បាល់កិនឫកស្លោស្លន់\n" +
                "\n" +
                "ប្រញាប់ទៅណាទើបរហន់                                                វ៊ីសនាំអាសន្នដល់រូបខ្ញុំ។\n" +
                "\n" +
                "ទោះកង់នាងបុកក៏មិនថ្វី                                                     ព្រោះបានឃើញស្រីពៅមាសមុំ\n" +
                "\n" +
                "ឬមួយនាងជាគូព្រេងខ្ញុំ                                                        ទើបអ្វីនាំមុំមកជួបបង។");
        Peom peom11 = new Peom("ប្រាសាទអង្គរ","ដំបូងខ្ញុំខឹងវ៊ីសជេស្តី                                                             តែលុះឃើញស្រីធាត់ទ្រលុក\n" +
                "\n" +
                "ទោះឈឺប៉ុណ្ណាខ្ញុំលាក់ទុក                                                  ប្រាប់នាងងើយមុខចរចារគ្នា។\n" +
                "\n" +
                "នាងងើយមុខចំចំជាស្អាត ថ្                                   ពាល់ឡើងក្រប៉ាតមុខពេញហ៊ារ\n" +
                "\n" +
                "ច្រមុះកោងស្រួចសាច់ថ្ពាល់យា                                      សក់ដូចរោមទាមានឈ្មោលជាន់។\n" +
                "\n" +
                "សំបុរនាងសដូចកូនចិន                                                     រាងដូចត្បាល់កិនឫកស្លោស្លន់\n" +
                "\n" +
                "ប្រញាប់ទៅណាទើបរហន់                                                វ៊ីសនាំអាសន្នដល់រូបខ្ញុំ។\n" +
                "\n" +
                "ទោះកង់នាងបុកក៏មិនថ្វី                                                     ព្រោះបានឃើញស្រីពៅមាសមុំ\n" +
                "\n" +
                "ឬមួយនាងជាគូព្រេងខ្ញុំ                                                        ទើបអ្វីនាំមុំមកជួបបង។");

        Peom.add(peom);
        Peom.add(peom1);
        Peom.add(peom2);
        Peom.add(peom3);
        Peom.add(peom4);
        Peom.add(peom5);
        Peom.add(peom6);
        Peom.add(peom7);
        Peom.add(peom8);
        Peom.add(peom9);
        Peom.add(peom10);
        Peom.add(peom11);

        ListsPoemAdapter listsPoemAdapter= new ListsPoemAdapter(Peom,this);
        linearLayoutManager.setOrientation(LinearLayoutManager.VERTICAL);
        recyclerView.setLayoutManager(linearLayoutManager);
        recyclerView.setAdapter(listsPoemAdapter);
        recyclerView.setHasFixedSize(true);
    }
}
